app/Controllers/SigninController.php

SELECT *
FROM `usuario`
WHERE `telefono` = '2212535186'
 LIMIT 1
---
    public function loginAuth()
    {
        $session = session();
        $ModelUsuarios = new ModelUsuarios();
        $telefono = $this->request->getVar('telefono');
        $password = $this->request->getVar('uPassword');
        $pregunta = $this->request->getVar('pregunta');
        $respuesta_pregunta = $this->request->getVar('respuesta');

        $data = $ModelUsuarios->where('telefono', $telefono)->first();