app/Controllers/usuarioControlador.php

    public function verificarcodigo()
    {

        $usuario = new ModelUsuarios();
        $session = session();

        $idusuario = $session->get('id_usuario');

        $datos_usuario = $usuario
            ->select('respuesta_pregunta, pregunta')
            ->where('id_usuario', $idusuario)
            ->first();
---
SELECT `respuesta_pregunta`, `pregunta`
FROM `usuario`
WHERE `id_usuario` = '22'
 LIMIT 1